tangeai/tirtc-device-example/complete-applications/esp32-p4/device-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Performance profile for the Waveshare ESP32-P4 board. Revision < 3 parts
# are qualified for 360 MHz; 400 MHz is intentionally not forced.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360
# CONFIG_PM_ENABLE is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
# CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM is not set
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=196608
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_FREERTOS_HZ=1000
# TiRTC 2.3.0 P4 package ABI/runtime contract.
# CONFIG_FREERTOS_USE_TRACE_FACILITY is not set
# CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS is not set
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_APP_AUDIO_AEC_ENABLE=y
CONFIG_APP_AUDIO_AEC_REF_DELAY_MS=80
CONFIG_APP_AI_CHAT_VIDEO_ENABLE=y
CONFIG_APP_WECHAT_VOIP_LOCAL_VIDEO_ENABLE=y
CONFIG_APP_WECHAT_VOIP_REMOTE_VIDEO_ENABLE=y
CONFIG_APP_RTC_H264_DIRECT_HW_ENCODER=y
CONFIG_APP_RTC_H264_RESOURCE_FALLBACK_ENABLE=y
CONFIG_APP_RTC_H264_BITRATE=4000000
CONFIG_APP_RTC_H264_FPS=20
CONFIG_APP_DEVICE_CALL_VIDEO_WIDTH=480
CONFIG_APP_DEVICE_CALL_VIDEO_HEIGHT=320
CONFIG_APP_DEVICE_CALL_VIDEO_FPS=15
CONFIG_APP_DEVICE_CALL_VIDEO_BITRATE=800000
CONFIG_APP_DEVICE_CALL_VIDEO_MIN_QP=22
CONFIG_APP_DEVICE_CALL_VIDEO_MAX_QP=40
CONFIG_APP_CALL_VIDEO_DIRECT_LCD=y
CONFIG_APP_RTC_H264_GOP=30
CONFIG_APP_RTC_H264_MIN_QP=34
CONFIG_APP_RTC_H264_MAX_QP=45
CONFIG_APP_RTC_H264_OUTPUT_BUFFER_BYTES=1048576
CONFIG_APP_RTC_H264_MAX_DELTA_PAYLOAD_BYTES=262144
CONFIG_APP_RTC_H264_STARTUP_GUARD_MS=2500
CONFIG_APP_RTC_H264_STARTUP_MAX_DELTA_PAYLOAD_BYTES=131072
# CONFIG_APP_RTC_VIDEO_AUTO_ADAPT_ENABLE is not set
# CONFIG_APP_RTC_SDK_VIDEO_ADAPT_ENABLE is not set
# CONFIG_APP_RTC_WAIT_VIDEO_SUBSCRIBE_BEFORE_CAPTURE is not set
# CONFIG_APP_DEVICE_ONLINE_PAUSE_DURING_RTC is not set
CONFIG_APP_DMA_ESCROW_BYTES=98304
CONFIG_APP_CAMERA_FRAME_TRACE_INITIAL_COUNT=0
CONFIG_APP_CAMERA_FRAME_TRACE_INTERVAL_MS=10000
CONFIG_APP_RTC_H264_KEY_FRAME_REQUEST_MIN_INTERVAL_MS=2000
CONFIG_APP_RTC_TRANSPORT_BACKPRESSURE_HOLD_MS=80
CONFIG_APP_TIRTC_QUERY_SEND_BUFFER_USED=y

CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_BSP_ERROR_CHECK=y
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_I2C_FAST_MODE=y
CONFIG_BSP_I2C_CLK_SPEED_HZ=400000
CONFIG_BSP_I2S_NUM=1
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MAX_FILES=5
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y

CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_CUSTOM_INCLUDE="stdlib.h"
CONFIG_LV_MEM_BUF_MAX_NUM=16
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=30
CONFIG_LV_INDEV_DEF_READ_PERIOD=15
CONFIG_LV_DPI_DEF=130
CONFIG_LV_DRAW_COMPLEX=y
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=12288
CONFIG_LV_IMG_CACHE_DEF_SIZE=2
CONFIG_LV_USE_ASSERT_NULL=y
CONFIG_LV_USE_ASSERT_MALLOC=y
CONFIG_LV_ASSERT_HANDLER_INCLUDE="assert.h"
CONFIG_LV_USE_USER_DATA=y
CONFIG_LV_ATTRIBUTE_MEM_ALIGN_SIZE=1
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_TXT_ENC_UTF8=y
CONFIG_LV_USE_IMG=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_BTN=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_THEME_DEFAULT=y

# CONFIG_APP_DEBUG_SCREEN_SERVER_ENABLE is not set
# CONFIG_APP_VERBOSE_RUNTIME_LOGS is not set
# CONFIG_APP_MEDIA_PERIODIC_DIAGNOSTICS is not set
CONFIG_APP_MEDIA_COMPACT_HEALTH_LOG=y

# Keep boot output to actionable warnings and errors. Application lifecycle
# logs remain at INFO and are filtered by app_log_policy.
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

CONFIG_CAMERA_OV5647=y
# CONFIG_CAMERA_OV5647_MIPI_RAW10_1920x1080_30FPS is not set
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280x960_BINNING_45FPS=y
CONFIG_CAMERA_OV5647_MIPI_IF_FORMAT_INDEX_DAFAULT=4
CONFIG_CAMERA_OV5647_CSI_LINESYNC_ENABLE=y
CONFIG_ESP_VIDEO_DISABLE_MIPI_CSI_DRIVER_BACKUP_BUFFER=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# ESP32-P4-WIFI6 board wireless link: ESP32-C6 slave over Hosted SDIO.
# CONFIG_ESP_HOST_WIFI_ENABLED is not set
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS is not set
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=15
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
# CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE is not set
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=20
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=20
# ESP-Hosted's P4+C6 profile uses deeper receive/aggregation queues than the
# ESP-IDF defaults. Keep static TX buffers for deterministic internal-RAM use,
# while moving eligible Wi-Fi/lwIP allocations to PSRAM via
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP.
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_STATIC_TX_BUFFER=y
CONFIG_WIFI_RMT_STATIC_TX_BUFFER_NUM=16
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# Match the official ESP32-P4 + ESP32-C6 ESP-Hosted socket profile. The tiny
# defaults (TCP/UDP mailbox 6 and 5760-byte TCP windows) are too shallow for
# bursty or higher-RTT networks such as phone hotspots.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y
# Bound out-of-order TCP buffering so Wi-Fi bursts cannot consume PSRAM
# indefinitely while preserving enough reordering tolerance for mobile links.
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
# Runtime Wi-Fi power save is also disabled by wifi.c. These options remove
# disconnected modem sleep and its sleep-only IRAM footprint from the host.
# CONFIG_WIFI_RMT_SLP_IRAM_OPT is not set
# CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE is not set
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_PEM_PARSE_C=y
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_DES_C=y
CONFIG_MBEDTLS_SHA1_C=y
CONFIG_MBEDTLS_USE_CRYPTO_ROM_IMPL=n
CONFIG_MBEDTLS_ROM_MD5=n

CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_QRCODE=y

CONFIG_LWIP_SNTP_MAX_SERVERS=4
# CONFIG_LWIP_SNTP_STARTUP_DELAY is not set
CONFIG_MQTT_PROTOCOL_5=y
# CONFIG_MQTT_TRANSPORT_WEBSOCKET is not set
# CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE is not set

# The P4 H264 downlink uses both cores. The helper and decoder caller run at
# priority 16 on different cores. Audio remains above them; LVGL runs at 15
# and receives an explicit scheduling window from the conversion pipeline.
CONFIG_ESP_H264_DECODER_IRAM=y
CONFIG_ESP_H264_DUAL_TASK=y
CONFIG_ESP_H264_DUAL_TASK_CORE=1
CONFIG_ESP_H264_DUAL_TASK_PRIORITY=16
